;; -*- no-byte-compile: t; -*-
;;; packages.el

;; Keep this small at first. Doom modules provide the first serious experiment:
;; Evil, Org, Magit, Dired, vterm, project navigation, LSP, and Nix editing.

(package! flycheck-inline)
(package! tldr)
(package! ob-rust)
(package! eshell-syntax-highlighting)
(package! rainbow-mode)
(package! indent-bars)
(package! evil-escape :disable t)
(package! evil-snipe :disable t)
